#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda: Reading...
module.lambda_function.data.external.archive_prepare[0]: Reading...
data.archive_file.lambda: Read complete after 0s [id=4d8dcb5bc76b080df01faa7097fdf922f4ef8272]
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=44bff5cf9d3bbdc1b23492ed2a878d920b789d7c]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5988132160444781006]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_partition.current: Reading...
module.lambda_function.data.aws_partition.current: Reading...
aws_apigatewayv2_api.api: Refreshing state... [id=ibnh5cj45g]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_function.data.aws_region.current: Reading...
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/imageGenerator-lambda]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.profile: Refreshing state... [id=profile]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=imageGenerator-lambda]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7797a1854717fed9d22a1133797392ed0b42e6ceee5ae1b18e9fea2879fdd5ae]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3589367311]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/imageGenerator-API]
aws_apigatewayv2_stage.apigateway: Refreshing state... [id=$default]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=imageGenerator-lambda-20240404152400024800000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=imageGenerator-lambda]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=image-generate,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_api.api will be updated in-place
  ~ resource "aws_apigatewayv2_api" "api" {
        id                           = "ibnh5cj45g"
      ~ name                         = "imageGenerator-API" -> "imageGenerator-API2"
        tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_apigatewayv2_integration.lambda["index"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda["profile-get"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda["profile-post"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.default_route will be created
  + resource "aws_apigatewayv2_route" "default_route" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["index"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["profile-get"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /profile"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["profile-post"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /profile"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.apigateway will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "apigateway" {
        id              = "$default"
        name            = "$default"
        tags            = {}
        # (7 unchanged attributes hidden)

      ~ access_log_settings {
          ~ destination_arn = "arn:aws:logs:us-east-1:730335392708:log-group:/aws/api_gw/imageGenerator-API" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.api_gw must be replaced
-/+ resource "aws_cloudwatch_log_group" "api_gw" {
      ~ arn               = "arn:aws:logs:us-east-1:730335392708:log-group:/aws/api_gw/imageGenerator-API" -> (known after apply)
      ~ id                = "/aws/api_gw/imageGenerator-API" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/api_gw/imageGenerator-API" -> "/aws/api_gw/imageGenerator-API2" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5988132160444781006" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1712255225731901000" -> "1712255716015846000"
            # (1 unchanged element hidden)
        }
    }

Plan: 9 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rauljrtafur, Action: `pull_request`*